In [3]:
x=10

In [4]:
print(x)

10

In [6]:
import pandas as pd

In [5]:
y=15
print(y)

15

In [8]:
data1 = pd.read_excel(r'C:\Users\Dell\Desktop\MyDat1.xlsx')

In [9]:
data1

    Name  Age  Salary
0  Pinky   30   20000
1   John   22   15000
2   Neha   25   30000
3    raj   26   35000

In [12]:
data2 = pd.read_csv(r'C:\Users\Dell\Desktop\MyDat2.csv')

In [15]:
data2

   Roll No.     Name  Batch
0      1001    Pinky   1840
1      1002     John   1843
2      1003   Deepak   1840
3      1004  Anjuman   1765

In [21]:
data4 = pd.read_csv(r'C:\Users\Dell\Desktop\MyDat3.tsv')

In [22]:
data4

  RollNo\tName\tBatch
0   1001\tPinky\t1840
1    1002\tJohn\t1765
2    1003\tNeha\t1345
3     1004\tRaj\t1540

In [23]:
data3 = pd.read_csv(r'C:\Users\Dell\Desktop\MyDat3.tsv', sep = '\t')

In [24]:
data3

   RollNo   Name  Batch
0    1001  Pinky   1840
1    1002   John   1765
2    1003   Neha   1345
3    1004    Raj   1540